In [1]:
import pandas as pd
import numpy as np
import os

In [2]:
#Importando arquivo excel

excel = pd.read_excel('../Conversões/ParaExcel.xlsx')

In [3]:
#cConvertendo para dataframe 
df = pd.DataFrame(excel)

#Excluindo arquivo intermendiário
caminho = '../Conversões/ParaExcel.xlsx'

if os.path.exists(caminho):
   os.remove(caminho)
else:
   print('Valor não encontrado!')

In [4]:
df.head()

,Time,Partidas,Vitorias,Empates,Derrotas,Gols_Pro,Gols_Contra,Saldo_Gols,Pontos
0,São Paulo,10,9,2,7,8,7,1,29
1,Naútico,10,7,5,6,7,11,-4,26
2,Sport,10,7,2,12,2,23,-21,23
3,Santa Cruz,10,5,3,5,5,5,0,18

In [6]:
display(df.info())
display(df.head())
display(df.describe())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Time         4 non-null      object
 1   Partidas     4 non-null      int64
 2   Vitorias     4 non-null      int64
 3   Empates      4 non-null      int64
 4   Derrotas     4 non-null      int64
 5   Gols_Pro     4 non-null      int64
 6   Gols_Contra  4 non-null      int64
 7   Saldo_Gols   4 non-null      int64
 8   Pontos       4 non-null      int64
dtypes: int64(8), object(1)
memory usage: 420.0+ bytes

None

,Time,Partidas,Vitorias,Empates,Derrotas,Gols_Pro,Gols_Contra,Saldo_Gols,Pontos
0,São Paulo,10,9,2,7,8,7,1,29
1,Naútico,10,7,5,6,7,11,-4,26
2,Sport,10,7,2,12,2,23,-21,23
3,Santa Cruz,10,5,3,5,5,5,0,18

,Partidas,Vitorias,Empates,Derrotas,Gols_Pro,Gols_Contra,Saldo_Gols,Pontos
count,4.0,4.000000,4.000000,4.000000,4.000000,4.000000,4.000000,4.000000
mean,10.0,7.000000,3.000000,7.500000,5.500000,11.500000,-6.000000,24.000000
std,0.0,1.632993,1.414214,3.109126,2.645751,8.062258,10.230673,4.690416
min,10.0,5.000000,2.000000,5.000000,2.000000,5.000000,-21.000000,18.000000
25%,10.0,6.500000,2.000000,5.750000,4.250000,6.500000,-8.250000,21.750000
50%,10.0,7.000000,2.500000,6.500000,6.000000,9.000000,-2.000000,24.500000
75%,10.0,7.500000,3.500000,8.250000,7.250000,14.000000,0.250000,26.750000
max,10.0,9.000000,5.000000,12.000000,8.000000,23.000000,1.000000,29.000000

In [7]:
display(df.head(2))
df.tail(2)

,Time,Partidas,Vitorias,Empates,Derrotas,Gols_Pro,Gols_Contra,Saldo_Gols,Pontos
0,São Paulo,10,9,2,7,8,7,1,29
1,Naútico,10,7,5,6,7,11,-4,26

,Time,Partidas,Vitorias,Empates,Derrotas,Gols_Pro,Gols_Contra,Saldo_Gols,Pontos
2,Sport,10,7,2,12,2,23,-21,23
3,Santa Cruz,10,5,3,5,5,5,0,18

In [ ]:
#1-Desempenho Geral

desempenho_info = df[['Time', 'Vitorias', 'Pontos', 'Saldo_Gols']].set_index('Time')
desempenho_info

            Vitorias  Pontos  Saldo_Gols
Time
São Paulo          9      29           1
Sport              7      23         -21
Naútico            7      26          -4
Santa Cruz         5      18           0

In [8]:
#2-Time com mais Vitórias

timesComMaisVitorias = df[df['Vitorias'] == df['Vitorias'].max()][['Time', 'Partidas']]
timesComMaisVitorias

        Time  Partidas
0  São Paulo        10

In [9]:
#3-Times com menos vitórias

timesComMenosvitorias = df[df['Vitorias']==df['Vitorias'].min()][['Vitorias','Time']]
timesComMenosvitorias

   Vitorias        Time
3         5  Santa Cruz

In [88]:
b = timesComMaisVitorias
a = b.copy()
a['Partidas'] = 99
display(a)
display(b)

        Time  Partidas
0  São Paulo        99

        Time  Partidas
0  São Paulo        10

In [73]:
#Teste de cópia

dados2 = {
    'Time': ['São Paulo', 'Sport'],
    'Pontos' : [2, 4],
    'Gols' : [3, 4]
}

df2 = pd.DataFrame(dados2)

In [74]:
df2.head()

        Time  Pontos  Gols
0  São Paulo       2     3
1      Sport       4     4

In [ ]:
df3 = df2[['Time', 'Gols']]
df3['Gols'] = 10

display(df2)
display(df3)

C:\Users\arcan\AppData\Local\Temp\ipykernel_16700\2919659919.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3['Gols'] = 10

        Time  Pontos  Gols
0  São Paulo       2     3
1      Sport       4     4

        Time  Gols
0  São Paulo    10
1      Sport    10

In [ ]:
df.head()

,Time,Partidas,Vitorias,Empates,Derrotas,Gols_Pro,Gols_Contra,Saldo_Gols,Pontos
0,São Paulo,10,9,2,7,8,7,1,29
1,Sport,10,7,2,12,2,23,-21,23
2,Naútico,10,7,5,6,7,11,-4,26
3,Santa Cruz,10,5,3,5,5,5,0,18

In [16]:
#Distribuição(contagem) de Gols Pro

df.value_counts(['Gols_Pro']).to_frame()

          count
Gols_Pro
2             1
5             1
7             1
8             1

In [101]:
#Agrupando de Gols Pro
df2 = df.groupby('Time')['Gols_Pro'].sum()
df2.reset_index()

         Time  Gols_Pro
0     Naútico         7
1  Santa Cruz         5
2       Sport         2
3   São Paulo         8

In [28]:
#4- Relação entre colunas Gols Pro e Pontos

correlacao = df['Gols_Pro'].corr(df['Pontos'])
correlacao

np.float64(0.5909368402852788)

In [29]:
#Correlaçãogols contr e pontos
correlacao2 = df['Gols_Contra'].corr(df['Pontos'])
correlacao2

np.float64(0.03525905902319634)